In [2]:
import pandas as pd

In [16]:
import faker

In [24]:
import random

In [26]:
# Creating the dataset
data = {
    "First Name": ["John", "Emma", "Michael", "Olivia", "Liam", "Sophia", "James", "Isabella", "Ethan", "Mia"],
    "Surname": ["Smith", "Johnson", "Brown", "Taylor", "Davis", "Miller", "Wilson", "Moore", "Clark", "Lewis"],
    "Age": [28, 34, 45, 22, 31, 27, 40, 36, 29, 25],
    "City": ["New York", "Los Angeles", "Chicago", "San Francisco", "Miami", "Seattle", "Austin", "Dallas", "Boston", "Denver"],
    "Hobby": ["Photography", "Reading", "Running", "Painting", "Cycling", "Traveling", "Cooking", "Yoga", "Gaming", "Hiking"],
    "Bank Name": ["Bank of America", "Chase", "Wells Fargo", "Citibank", "Bank of America", "Capital One", "Chase", "Wells Fargo", "Citibank", "Capital One"],
    "Gender": ["Male", "Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male", "Female"]
}

# Creating a DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

  First Name  Surname  Age           City        Hobby        Bank Name  \
0       John    Smith   28       New York  Photography  Bank of America
1       Emma  Johnson   34    Los Angeles      Reading            Chase
2    Michael    Brown   45        Chicago      Running      Wells Fargo
3     Olivia   Taylor   22  San Francisco     Painting         Citibank
4       Liam    Davis   31          Miami      Cycling  Bank of America
5     Sophia   Miller   27        Seattle    Traveling      Capital One
6      James   Wilson   40         Austin      Cooking            Chase
7   Isabella    Moore   36         Dallas         Yoga      Wells Fargo
8      Ethan    Clark   29         Boston       Gaming         Citibank
9        Mia    Lewis   25         Denver       Hiking      Capital One

   Gender
0    Male
1  Female
2    Male
3  Female
4    Male
5  Female
6    Male
7  Female
8    Male
9  Female

In [30]:
# short values
df.sort_values(by='Surname')

,First Name,Surname,Age,City,Hobby,Bank Name,Gender
2,Michael,Brown,45,Chicago,Running,Wells Fargo,Male
8,Ethan,Clark,29,Boston,Gaming,Citibank,Male
4,Liam,Davis,31,Miami,Cycling,Bank of America,Male
1,Emma,Johnson,34,Los Angeles,Reading,Chase,Female
9,Mia,Lewis,25,Denver,Hiking,Capital One,Female
5,Sophia,Miller,27,Seattle,Traveling,Capital One,Female
7,Isabella,Moore,36,Dallas,Yoga,Wells Fargo,Female
0,John,Smith,28,New York,Photography,Bank of America,Male
3,Olivia,Taylor,22,San Francisco,Painting,Citibank,Female
6,James,Wilson,40,Austin,Cooking,Chase,Male

In [34]:
#sort values for multiple columns.
df.sort_values(by=['Hobby','City'])

,First Name,Surname,Age,City,Hobby,Bank Name,Gender
6,James,Wilson,40,Austin,Cooking,Chase,Male
4,Liam,Davis,31,Miami,Cycling,Bank of America,Male
8,Ethan,Clark,29,Boston,Gaming,Citibank,Male
9,Mia,Lewis,25,Denver,Hiking,Capital One,Female
3,Olivia,Taylor,22,San Francisco,Painting,Citibank,Female
0,John,Smith,28,New York,Photography,Bank of America,Male
1,Emma,Johnson,34,Los Angeles,Reading,Chase,Female
2,Michael,Brown,45,Chicago,Running,Wells Fargo,Male
5,Sophia,Miller,27,Seattle,Traveling,Capital One,Female
7,Isabella,Moore,36,Dallas,Yoga,Wells Fargo,Female

In [44]:
df['Age'].nlargest(3)

2    45
6    40
7    36
Name: Age, dtype: int64

In [46]:
df.groupby('Gender')['Age'].mean()

Gender
Female    28.8
Male      34.6
Name: Age, dtype: float64

In [52]:
df.groupby('City')['First Name'].count()

City
Austin           1
Boston           1
Chicago          1
Dallas           1
Denver           1
Los Angeles      1
Miami            1
New York         1
San Francisco    1
Seattle          1
Name: First Name, dtype: int64

In [54]:
df.groupby('Bank Name')['Age'].mean()

Bank Name
Bank of America    29.5
Capital One        26.0
Chase              37.0
Citibank           25.5
Wells Fargo        40.5
Name: Age, dtype: float64

In [64]:
df.groupby(['Gender','Hobby'])['Age'].mean()

Gender  Hobby
Female  Hiking         25.0
        Painting       22.0
        Reading        34.0
        Traveling      27.0
        Yoga           36.0
Male    Cooking        40.0
        Cycling        31.0
        Gaming         29.0
        Photography    28.0
        Running        45.0
Name: Age, dtype: float64

In [68]:
df.groupby('Gender')['Age'].sum()

Gender
Female    144
Male      173
Name: Age, dtype: int64

In [70]:
df.groupby('Gender')['Age'].max()

Gender
Female    36
Male      45
Name: Age, dtype: int64

In [76]:
df.groupby('Gender').agg({
    'Age': ['mean', 'sum'],
    'Hobby':'count',
    'Bank Name': 'nunique'
})

         Age      Hobby Bank Name
        mean  sum count   nunique
Gender
Female  28.8  144     5         4
Male    34.6  173     5         4

In [82]:
filt=df['City']!='Mumbai'
df.loc[filt]['Hobby'].value_counts()

Hobby
Photography    1
Reading        1
Running        1
Painting       1
Cycling        1
Traveling      1
Cooking        1
Yoga           1
Gaming         1
Hiking         1
Name: count, dtype: int64

In [88]:
filt=df['City']=='Mumbai'
df.loc[filt]['Hobby'].value_counts()

Series([], Name: count, dtype: int64)

In [94]:
filt=df['Age']<30
df.loc[filt]['City'].str.contains('New York').sum()

1

In [ ]:
# p.replace('NA', np.nan ,inplace=True)
# p.replace('Missing', np.nan ,inplace=True)